In [1]:
import pandas as pd

In [3]:
df1=pd.read_excel('Edtech_startup_updated.xlsx')

In [4]:
df1.head()

                Unnamed: 0          Unnamed: 1
0                      NaN                 NaN
1               Row Labels  Sum of Final score
2            Aaron Potsick                 631
3  Abdo Timejardine-Zomeño                  22
4     Alan Ronald Chernoff                 140

In [5]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 47 entries, 0 to 46
Data columns (total 2 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  46 non-null     object
 1   Unnamed: 1  44 non-null     object
dtypes: object(2)
memory usage: 880.0+ bytes